import requests

def get_joke():
    print("--- 😂 अजिंक्यसाठी एक खास जोक ---")
    
    # एका फ्री इंटरनेट लिंकवरून (API) जोक मागवणे
    url = "https://official-joke-api.appspot.com/random_joke"
    
    try:
        response = requests.get(url)
        data = response.json() # आलेली माहिती पायथॉन फॉरमॅटमध्ये बदलणे
        
        print(f"\nप्रश्न: {data['setup']}")
        print(f"उत्तर: {data['punchline']} 🤣")
        
    except:
        print("इंटरनेट कनेक्शन तपासा किंवा पुन्हा प्रयत्न करा!")

# फंक्शन चालवा
get_joke()
